fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>InformationRegister.ВКМ_СведенияОбОтпусках</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбщаяПродолжительностьОтпуска</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/InformationRegisters/ВКМ_СведенияОбОтпусках/ВКМ_СведенияОбОтпусках.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_СведенияОбОтпусках</name>
  <informationRegisterPeriodicity>Year</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ПлановаяПродолжительностьОтпуска</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ГрафикУжеСуществует() Тогда
		ТекстСообщения = СтрШаблон(
			"Запись невозможна. На %1 год график уже существует.",
			Формат(Год, "ЧГ=0"));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "Год", , Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Свернуть отпуска по сотрудникам: у одного сотрудника может быть 
	// несколько отпусков за год
	ДанныеОтпусков = ОтпускаСотрудников.Выгрузить();
	ДанныеОтпусков.Свернуть("Сотрудник", "ОбщаяПродолжительностьОтпуска");
	
	// Заблокировать регистр сведений об отпусках по сотрудникам документа
	Если НЕ ЗаблокироватьРегистрСведенийОбОтпусках(ДанныеОтпусков, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	Движения.ВКМ_СведенияОбОтпусках.Записывать = Истина;
	
	Для Каждого СтрокаОтпуска Из ДанныеОтпусков Цикл
		
		Движение = Движения.ВКМ_СведенияОбОтпусках.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = СтрокаОтпуска.Сотрудник;
		Движение.Год = Год;
		Движение.ПлановаяПродолжительностьОтпуска = 
			СтрокаОтпуска.ОбщаяПродолжительностьОтпуска;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Проверяет, существует ли уже документ ГрафикОтпусков на этот же год.
// Исключает сам текущий документ из проверки.
//
// Возвращаемое значение:
//   Булево - Истина, если график на этот год уже существует.
//
Функция ГрафикУжеСуществует()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВКМ_ГрафикОтпусков.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ВКМ_ГрафикОтпусков КАК ВКМ_ГрафикОтпусков
		|ГДЕ
		|	ВКМ_ГрафикОтпусков.Год = &Год
		|	И ВКМ_ГрафикОтпусков.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Год", Год);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

// Блокирует регистр сведений об отпусках по сотрудникам документа,
// чтобы исключить параллельную запись из другого сеанса.
//
// Параметры:
//   ДанныеОтпусков - ТаблицаЗначений - свернутая по сотрудникам ТЧ.
//   Отказ - Булево - (входной/выходной) признак отказа проведения.
//
// Возвращаемое значение:
//   Булево - Истина, если блокировка установлена.
//
Функция ЗаблокироватьРегистрСведенийОбОтпусках(ДанныеОтпусков, Отказ)
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить(
		"РегистрСведений.ВКМ_СведенияОбОтпусках");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	Для Каждого СтрокаОтпуска Из ДанныеОтпусков Цикл
		ЭлементБлокировки.УстановитьЗначение(
			"Сотрудник", СтрокаОтпуска.Сотрудник);
	КонецЦикла;
	
	Попытка
		Блокировка.Заблокировать();
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(
			ИнформацияОбОшибке());
		ОбщегоНазначения.СообщитьПользователю(
			"Не удалось заблокировать данные для расчета. Документ не проведён.
			|Подробности: " + ТекстОшибки, , , , Отказ);
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#КонецЕсли
